c5/src/InformationRegisters/Schedules/Schedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Schedules</name>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>DurationEvening</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>DurationNight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>MinutesEvening</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>MinutesNight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Schedule</name>
    <type>
      <types>CatalogRef.Schedules</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Schedules/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure FillCheckProcessingAtServer ( Cancel, CheckedAttributes )
	
	if ( not checkHours () ) then
		Cancel = true;
	endif; 
	
EndProcedure

&AtServer
Function checkHours ()
	
	if ( ( Record.Duration - Record.DurationEvening - Record.DurationNight ) < 0 ) then
		Output.WrongTotalHours ( , "Duration" );
		return false;
	endif; 
	return true;
	
EndFunction 

// *****************************************
// *********** Group Form

&AtClient
Procedure DurationOnChange ( Item )
	
	Conversion.AdjustTime ( Record.Duration );
	calcMinutes ();
	
EndProcedure

&AtClient
Procedure calcMinutes ()
	
	Record.Minutes = Conversion.DurationToMinutes ( Record.Duration );
	
EndProcedure
